function setup() {
  createCanvas(600, 400);
  noLoop(); // 한 번만 그리도록 설정
}

function draw() {
  background(30, 35, 40); // 짙은 회색 배경

  // 빌딩 숲
  stroke(0); 
  strokeWeight(2); 

  
  fill(80, 80, 80);
  rect(0, 200, 150, 200);     
  rect(100, 150, 100, 250);   
  fill(95, 95, 95);
  rect(300, 220, 120, 180);   
  rect(400, 180, 90, 220);  
  
  
  fill(70, 70, 70, 200);
  rect(80, 190, 120, 210);  
  fill(100, 100, 100, 200);
  rect(200, 120, 150, 280); 
  
  
  fill(130, 130, 130);
  rect(0, 250, 90, 150);     
  rect(250, 100, 100, 300);  
  rect(480, 160, 100, 240);  

  
  fill(100, 100, 100);
  quad(150, 400, 220, 400, 250, 200, 180, 180); 
  fill(120, 120, 120);
  quad(500, 400, 580, 400, 590, 220, 530, 200); 



  
//달
  noStroke(); 
  fill(255, 235, 59, 70);
  circle(500, 100, 120);

  // 빌딩 액세서리
  stroke(0); 
  strokeWeight(1.5);

  
    fill(95, 95, 95);
  triangle(100, 150, 200, 150, 150, 80); // y좌표 150, 150, 80

  
  fill(95, 95, 95);
  arc(445, 180, 90, 80, PI, 0); // y좌표 180

  

  line(275, 120, 275, 60); // y좌표 120 -> 60
  line(275, 80, 260, 70);
  line(275, 80, 290, 70);
  

  // 밤하늘 표현
  noStroke(); 
  fill(255, 235, 59, 200);

  
  circle(50, 70, 3);
  circle(180, 100, 2.5);
  circle(300, 50, 3);
  circle(580, 20, 2.5);
  circle(80, 10, 2.5);
  circle(220, 20, 2);
  circle(420, 80, 3);
  circle(530, 70, 2.5);
  circle(590, 10, 2);
  circle(140, 10, 3);
  circle(120, 40, 2.5);
  circle(250, 80, 2);
  circle(400, 60, 2.5);
  circle(30, 120, 2);
  circle(150, 150, 3);
  circle(350, 110, 2.5);
  circle(470, 160, 2);
  circle(10, 180, 3);
  circle(280, 130, 2.5);
  circle(450, 30, 2);
  circle(370, 170, 2.5);
  circle(550, 190, 3);

  
  stroke(255, 235, 59, 150); // 유성 색상을 반투명 노란색으로 설정
  strokeWeight(1.5);
  line(100, 30, 200, 60);
  line(400, 50, 500, 70);
  line(20, 100, 80, 120);
  line(300, 10, 350, 30);
}